In [8]:
import sqlite3
import pandas as pd

In [9]:
conn = sqlite3.connect("internship.db")
cursor = conn.cursor()

In [20]:
cursor.execute("""
CREATE TABLE interns1 (
    intern_id INTEGER PRIMARY KEY,
    intern_name TEXT,
    track TEXT,
    stipend INTEGER
)
""")

In [21]:
cursor.executemany("""
INSERT INTO interns1 (intern_id, intern_name, track, stipend)
VALUES (?, ?, ?, ?)
""", [
    (1, "jeevan", "AI", 7000),
    (2, "rakshith", "Web", 4000),
    (3, "shamanth", "AI", 8000),
    (4, "anusha", "Data Science", 6000),
    (5, "raj", "Data Science", 4500)
])

conn.commit()

In [22]:
query1 = """
SELECT *
FROM interns1
WHERE track = 'Data Science'
AND stipend > 5000
"""

df1 = pd.read_sql_query(query1, conn)
df1

   intern_id intern_name         track  stipend
0          4      anusha  Data Science     6000

In [23]:
query2 = """
SELECT track, AVG(stipend) AS avg_stipend
FROM interns1
GROUP BY track
"""

df2 = pd.read_sql_query(query2, conn)
df2

          track  avg_stipend
0            AI       7500.0
1  Data Science       5250.0
2           Web       4000.0

In [26]:
query3 = """
SELECT track, COUNT(*) AS total_interns
FROM interns1
GROUP BY track
"""

df3 = pd.read_sql_query(query3, conn)
df3

          track  total_interns
0            AI              2
1  Data Science              2
2           Web              1